План_полетов_файловый_edt/src/Documents/ФормаС/ФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормаС</name>
  <registerRecords>InformationRegister.СоздателиФормаС</registerRecords>
  <registerRecords>InformationRegister.СвязьФормаСПрилетВылет</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеФормС</registerRecords>
  <registerRecords>InformationRegister.ОтветственныеФормаС</registerRecords>
  <attributes>
    <name>РейсПрибытия</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецВС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПосадки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяВылета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прилет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вылет</name>
    <type>
      <types>DocumentRef.Вылеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>CatalogRef.ПредставителиАвиакомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеРегламента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>Истина - У.Е., Ложь - Рубль</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/ОтветственныеФормаС/ОтветственныеФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеФормаС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ФормаС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/СоздателиФормаС/СоздателиФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоздателиФормаС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ФормаС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/AccumulationRegisters/ДанныеФормС/ДанныеФормС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеФормС</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецВС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

План_полетов_файловый_edt/src/Documents/ФормаС/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//// регистр Ответственные 
	
	Движения.ОтветственныеФормаС.Записывать = Истина;
	Движение = Движения.ОтветственныеФормаС.Добавить();
	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Движение.Документ = Ссылка;
	Движение.Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоздателиФормаС.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.СоздателиФормаС КАК СоздателиФормаС
	|ГДЕ
	|	СоздателиФормаС.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		движения.СоздателиФормаС.Записывать = Истина;
		Движение = Движения.СоздателиФормаС.Добавить();
		Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Движение.Документ = Ссылка;
		Движение.Дата = ТекущаяДата();	
	КонецЕсли;
	
	// регистр ДанныеФормС 
	
	Движения.ДанныеФормС.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ДанныеФормС.Добавить();
		Движение.Период = Дата;
		Движение.РейсОтправления = РейсОтправления;
		Движение.ВладелецВС = ВладелецВС;
		Движение.Плательщик = Плательщик;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Количество = ТекСтрокаУслуги.Количество;
		Движение.Цена = ТекСтрокаУслуги.Цена;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
		Движение.НДС = ТекСтрокаУслуги.НДС;
		Движение.Скидка = ТекСтрокаУслуги.Скидка;
		Движение.НомерБорта = НомерБорта;
		Движение.КурсВалюты = КурсВалюты;
		Движение.Основание = ТекСтрокаУслуги.Основание;
		Движение.ТипВС = ТипВС;
	КонецЦикла;
КонецПроцедуры
